Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/life_skills_training_for_people_with_a_visual_impairment.html.txt.tmx
Source language: en
Languages: ga

source: Life skills training for people with vision impairments
ga: Bunchúrsa do dhaoine le lagú amhairc

source: The National Council for the Blind of Ireland (NCBI) offers a rehabilitation programme entitled Learning for life for people with a significant degree of sight loss
ga: Cuireann Comhairle Náisiúnta na hÉireann do na Daill (CNÉD) cúrsa athshlánúcháin ar fáil ar a dtugtar Foghlaim don Saol. Tá sé dírithe ar dhaoine a bhfuil lagú suntasach ar an amharc acu

source: This includes individuals with impaired vision since birth and those whose vision impairment has occurred later in life (for example, as a result of an accident, illness, or a progressive disorder)
ga: Tugtar san áireamh daoine a bhfuil lagú ar a n-amharc ón mbroinn agus daoine ar tharla an lagú ar a n-amharc tráth is faide amach ina saol (mar shampla, de bharr timpiste, tinnis nó galair bhreisithigh)

source: The aim of the programme is to maximise the quality of life and independence of trainees in accordance with their own wishes
ga: Tá d’aidhm ag an gclár go mbeadh caighdeán saoil agus neamhspleáchas ag na hoiliúnaithe chomh maith agus is féidir, de réir mar is toil leo féin

source: Core elements of the course include mobility, technology training, and daily living skills
ga: Tá gluaisteacht, traenáil sa teicneolaíocht agus gnáthscileanna maireachtála ina ngnéithe lárnacha den chúrsa

source: The programme aims to provide trainees with the skills, knowledge and attitude required to access further education and training
ga: Féachtar leis an gclár seo go bhfaigheadh na hoiliúnaithe scileanna, eolas agus meon is gá chun breis oideachais agus oiliúna a fháil

source: The course is open to anyone who is eligible to apply
ga: Tá cead ar an gcúrsa ag aon duine atá i dteideal cur isteach air

source: No previous educational or other qualifications are necessary to do the course; likewise, applicants will not be excluded from the course if they do have educational or other qualifications or are working
ga: Níl gá le haon cháilíochtaí oideachais ná eile chun an cúrsa a leanacht; ar an gcaoi chéanna, ní choscfar an cúrsa ar iarrthóirí a bhfuil cáilíochtaí oideachais nó eile acu nó atá ag obair

source: You can find more information in our document about working with a disability
ga: Faigh tuilleadh faisnéise inár gcáipéis Ag obair faoi mhíchumas

source: The foundation course is open to people with a significant degree of sight loss
ga: Tá cead ar an mbunchúrsa ag daoine a bhfuil méid suntasach den amharc caillte acu

source: The content of the course is divided into several sections. These include:
ga: Roinntear ábhar an chúrsa i gcodanna éagsúla, ina measc:

source: You can find further information on mobility training for people with visual impairment here
ga: Tá tuilleadh eolais maidir le hoiliúint sa ghluaisteacht do dhaoine le lagú amhairc

source: If trainees have completed areas of the course that are eligible for certification (for example, computer skills), certificates will be awarded to trainees through Quality and Qualifications Ireland (QQI)
ga: Má chríochnaíonn oiliúnaithe réimsí den chúrsa a bhfuiltear i dteideal teastais maidir leo (scileanna ríomhaireachta, mar shampla) bronnfar teastais ar na hoiliúnaithe trí Dhearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE)

source: There is an Employment Officer on-site at the NCBI, who will assist trainees in their job-seeking endeavours (for example, career guidance, preparation of CVs, help finding work placements, advice, etc.) but it is up to individual trainees to source future employment
ga: Tá Oifigeach Fostaíochta san ionad ag CNÉD, a chuideoidh leis na hoiliúnaithe san iarracht post a aimsiú (mar shampla, treoir ghairme, ullmhú CV, cúnamh le socraíochtaí oibre a aimsiú, comhairle, agus araile) ach is faoin duine féin é fostaíocht a fháil

source: The course is free of charge
ga: Conas iarratas a dhéanamh
